CREATE TABLE `education` (
`日期` date NOT NULL,
`标题` varchar(100) NOT NULL,
`信息类别` varchar(100) NOT NULL,
`发文机构` varchar(100) NOT NULL,
`内容概述` varchar(100) NOT NULL)character set utf8;

insert into education values('2020/9/30' , ' 国务院学位委员会, 教育部关于印发《专业学位研究生教育发展方案（2020-2025）》的通知' , 
'高等教育','国务院学位委员会 教育部', '国务院学位委员会、教育部印发《专业学位研究生教育发展方案（2020-2025）》。');
insert into education values('2020/9/30' , ' 国务院学位委员会关于开展2020年博士硕士学位授权审核工作的通知' , 
'教育综合管理','国务院学位委员会', ' 国务院学位委员会发布《关于开展2020年博士硕士学位授权审核工作的通知》。'); 


                           




select count(信息类别) from education where 信息类别 = '高等教育'
select count(信息类别) from education where 信息类别 = '教育综合管理'
select count(信息类别) from education where 信息类别 = '发展规划'
select count(信息类别) from education where 信息类别 = '干部人事人才'
select count(信息类别) from education where 信息类别 = '职业教育与成人教育'
select count(信息类别) from education where 信息类别 = '其他'
select count(信息类别) from education where 信息类别 = '政务概况'
select count(信息类别) from education where 信息类别 = '国际合作与交流'
select count(信息类别) from education where 信息类别 = '科学研究'
select count(信息类别) from education where 信息类别 = '部门规章'
select count(信息类别) from education where 信息类别 = '(空白)'
select count(信息类别) from education where 信息类别 = '科学研究'


select count(发文机构) from education where 信息类别 = '部门联合'
select count(发文机构) from education where 信息类别 = '国务院学位委员会'
select count(发文机构) from education where 信息类别 = '其他'
select count(发文机构) from education where 信息类别 = '教育部'
select count(发文机构) from education where 信息类别 = '教育部办公厅'
select count(发文机构) from education where 信息类别 = '教育部学位管理与研究生教育司'
select count(发文机构) from education where 信息类别 = '教育部职业教育与成人教育司'
select count(发文机构) from education where 信息类别 = '中华人民共和国教育部 国务院学位委员会'
select count(发文机构) from education where 信息类别 = '教育部国际合作与交流司'
select count(发文机构) from education where 信息类别 = '教育部思想政治工作司'
select count(发文机构) from education where 信息类别 = '教育部思想政治工作司 教育部学位管理与研究生教育司'




select 日期, count(日期)
from education group by 日期 having
日期 like '1998%'

select 日期, count(日期)
from education group by 日期 having
日期 like '1999%'

select 日期, count(日期)
from education group by 日期 having
日期 like '2000%'

select 日期, count(日期)
from education group by 日期 having
日期 like '2001%'

select 日期, count(日期)
from education group by 日期 having
日期 like '2002%'

select 日期, count(日期)
from education group by 日期 having
日期 like '2003%'

select 日期, count(日期)
from education group by 日期 having
日期 like '2004%'

select 日期, count(日期)
from education group by 日期 having
日期 like '2005%'

select 日期, count(日期)
from education group by 日期 having
日期 like '2006%'

select 日期, count(日期)
from education group by 日期 having
日期 like '2007%'

select 日期, count(日期)
from education group by 日期 having
日期 like '2008%'

select 日期, count(日期)
from education group by 日期 having
日期 like '2009%'

select 日期, count(日期)
from education group by 日期 having
日期 like '2010%'

select 日期, count(日期)
from education group by 日期 having
日期 like '2011%'

select 日期, count(日期)
from education group by 日期 having
日期 like '2012%'

select 日期, count(日期)
from education group by 日期 having
日期 like '2013%'

select 日期, count(日期)
from education group by 日期 having
日期 like '2014%'

select 日期, count(日期)
from education group by 日期 having
日期 like '2010%'

select 日期, count(日期)
from education group by 日期 having
日期 like '2015%'

select 日期, count(日期)
from education group by 日期 having
日期 like '2016%'

select 日期, count(日期)
from education group by 日期 having
日期 like '2017%'

select 日期, count(日期)
from education group by 日期 having
日期 like '2018%'

select 日期, count(日期)
from education group by 日期 having
日期 like '2019%'

select 日期, count(日期)
from education group by 日期 having
日期 like '2020%'


“2020/9/30“,“2020/9/30“,“2020/9/28“,“2020/09/21“ ,“2020/9/2“,“2020/8/27“,“2020/7/15“
 “2020/05/07“
 “2020/04/28“
“2020/4/13“
“2020/2/28“
 “2020/02/04“
“2019/10/30“
“2019/9/30“
“2019/9/12“
“2019/8/14“
“2019/6/4“
 “2019/03/04“
“2019/3/4“
 “2019/01/29“
“2018/11/26“
“2018/11/14“
“2018/10/8“
“2018/9/30“
 “2018/08/27“
 “2018/08/21“
“2018/8/20“
“2018/8/15“
“2018/5/10“
“2018/4/19“
“2018/3/16“
“2018/1/18“
“2017/9/26“
 “2017/08/29“
“2017/8/7“
“2017/6/22“
“2017/5/10“
“2017/5/3“
“2017/4/10“
“2017/3/30“
“2017/2/10“
“2017/1/20“
“2017/1/3“
“2016/9/29“
“2016/9/5“
“2016/9/2“
“2016/6/12“
“2016/5/6“
“2016/4/1“
“2016/3/29“
“2016/3/28“
“2016/3/25“
“2016/3/22“
“2016/3/11“
“2016/2/4“
“2015/12/1“
“2015/10/23“
“2015/9/29“
“2015/9/25“
“2015/9/11“
“2015/8/13“
“2015/7/30“
“2015/7/14“
“2015/7/8“
“2015/7/2“
“2015/5/29“
“2015/5/21“
“2015/5/11“
“2015/5/11“
“2015/4/9“
“2015/4/9“
“2015/4/1“
“2015/3/30“
“2015/3/13“
“2015/2/12“
“2015/1/20“
“2014/12/24“
“2014/12/5“
“2014/9/30“
“2014/9/13“
“2014/8/27“
“2014/8/19“
“2014/8/4“
“2014/7/14“
“2014/7/7“
“2014/7/7“
“2014/6/18“
“2014/6/12“
“2014/5/6“
“2020/9/30“
“2020/9/30“
“2020/9/28“
 “2020/09/21“
“2020/9/2“
“2020/8/27“
“2020/7/15“
 “2020/05/07“
 “2020/04/28“
“2020/4/13“
“2020/2/28“
 “2020/02/04“
“2019/10/30“
“2019/9/30“
“2019/9/12“
“2019/8/14“
“2019/6/4“
 “2019/03/04“
“2019/3/4“
 “2019/01/29“
“2018/11/26“
“2018/11/14“
“2018/10/8“
“2018/9/30“
 “2018/08/27“
 “2018/08/21“
“2018/8/20“
“2018/8/15“
“2018/5/10“
“2018/4/19“
“2018/3/16“
“2018/1/18“
“2017/9/26“
 “2017/08/29“
“2017/8/7“
“2017/6/22“
“2017/5/10“
“2017/5/3“
“2017/4/10“
“2017/3/30“
“2017/2/10“
“2017/1/20“
“2017/1/3“
“2016/9/29“
“2016/9/5“
“2016/9/2“
“2016/6/12“
“2016/5/6“
“2016/4/1“
“2016/3/29“
“2016/3/28“
“2016/3/25“
“2016/3/22
“2016/3/11
“2016/2/4
“2015/12/1
“2015/10/23
“2015/9/29
“2015/9/25
“2015/9/11
“2015/8/13
“2015/7/30
“2015/7/14
“2015/7/8
“2015/7/2
“2015/5/29
“2015/5/21
“2015/5/11
“2015/5/11
“2015/4/9
“2015/4/9
“2015/4/1
“2015/3/30
“2015/3/13
“2015/2/12
“2015/1/20
“2014/12/24
“2014/12/5
“2014/9/30
“2014/9/13
“2014/8/27
“2014/8/19
“2014/8/4
“2014/7/14
“2014/7/7
“2014/7/7
“2014/6/18
“2014/6/12
“2014/5/6
“2014/4/18
“2014/4/11
“2014/3/27
“2014/3/19
“2014/3/13
“2014/2/12
“2014/2/12
“2014/2/12
“2014/1/23
“2013/12/4
“2013/12/3
“2013/12/3
“2013/11/20
“2013/11/13
“2013/8/28
“2013/5/16
“2013/4/19
“2013/4/2
“2013/3/19
“2013/2/28
“2013/1/29
“2013/1/24
“2012/12/27
“2012/12/14
“2012/11/19
“2012/11/5
“2012/8/23
“2012/7/24
“2012/5/30
“2012/5/22
“2012/5/16
“2012/5/7
“2012/4/28
“2012/3/28
“2012/3/16
“2012/1/20
“2012/1/20
“2012/1/10
“2012/1/6
“2012/1/4
“2011/11/21
“2011/11/15
“2011/10/17
“2011/8/8
“2011/7/29
“2011/5/18
“2011/4/25
“2011/4/20
“2011/4/14
“2011/4/7
“2011/3/8
“2011/3/8
“2011/1/31
“2010/12/24
“2010/12/6
“2010/11/17
“2010/10/13
“2010/8/25
“2010/8/6
“2010/7/29
“2010/5/10
“2010/5/7
“2010/4/26
“2010/4/15
“2010/3/24
“2010/3/24
“2010/2/25
“2010/2/21
“2009/12/3
“2009/11/23
“2009/10/29
“2009/10/9
“2009/9/29
“2009/9/25
“2009/9/4
“2009/3/19
“2009/3/2
“2009/2/20
“2009/1/7
“2008/12/10
“2008/11/6
“2008/9/4
“2008/6/17
“2008/4/15“
“2008/4/11“
“2008/4/6“
“2008/3/28“
“2008/2/17“
“2008/1/21“
“2008/1/7“
“2007/12/26“
“2007/12/11“
“2007/12/10“
“2007/12/10“
“2007/11/14“
“2007/11/10“
“2007/10/23“
“2007/9/29“
“2007/9/29“
“2007/9/12“
“2007/6/21“
“2007/6/1“
“2007/4/13“
“2007/4/10“
“2007/3/30“
“2007/3/30“
“2007/1/15“
“2006/11/7“
“2006/10/31“
“2006/10/30“
“2006/10/27“
“2006/10/24“
“2006/10/11“
“2006/9/26“
“2006/9/21“
“2006/9/21“
“2006/9/15“
“2006/9/8“
“2006/8/3“
“2006/7/23“
“2006/7/15“
“2006/7/12“
“2006/6/13“
“2006/6/9“
“2006/4/13“
“2006/4/1“
“2006/3/3“
“2006/3/2“
“2006/1/25“
“2006/1/20“
“2006/1/20“
“2006/1/6“
“2005/12/23“
“2005/12/23“
“2005/11/11“
“2005/9/25“
“2005/9/15“
“2005/8/9“
“2005/7/19“
“2005/6/20“
“2005/4/26“
“2005/4/22“
“2005/3/15“
“2005/3/10“
“2005/3/1“
“2005/2/24“
“2004/11/1“
“2004/8/25“
“2004/6/21“
“2004/6/15“
“2004/2/11“
“2003/11/21“
“2003/9/24“
“2003/7/9“
“2003/5/20“
“2003/3/11“
“2002/12/27“
“2002/6/12“
“2002/1/9“
“2001/4/28“
“2001/4/24“
“2000/6/8“
“2000/5/30“
“1999/9/24“
“1998/2/4“
“1987/6/6“

